# 1. Дана строка. Выведите её длину, первый и последний символы.

str_1 = input('Введите строку: ')

print(f"Длина строки: {len(str_1)}")
print(f"Первый символ: {str_1[0]}. Последний символ: {str_1[-1]}")

# 2. Выведите символ, стоящий в середине строки. Для строки чётной длины выведите оба средних.

str_2 = input("Введите строку: ")

lenght = len(str_2)

if lenght==0:
    print("Строка пустая")
elif lenght % 2 != 0:
    middle = str_2[lenght//2]
    print(f"Средний символ:{middle}")
else:
    middle_1 = str_2[(lenght//2)-1]
    middle_2 = str_2[lenght//2]
    print(f"Средние символы: {middle_1},{middle_2}")

# 3. Из строки получите: первые три символа, последние три, все символы с чётными индексами, строку в обратном порядке.

str_3 = input("Введите строку: ")

print(f"Первые три символа строки:{str_3[:3]}")
print(f"Последние три символа строки:{str_3[-3:]}")
print(f"Символы с четными индексами:{str_3[::2]}")
print(f"Строка в обратном порядке:{str_3[::-1]}")

# 4. Дана строка. Выведите её в верхнем регистре, в нижнем регистре и с заглавной первой буквой.

str_4 = input("Введите строку: ")

print(f"Строка в верхнем регистре: {str_4.upper()}")
print(f"Строка в нижнем регистре: {str_4.lower()}")
print(f"Строка с заглавной буквы: {str_4.capitalize()}")

# 5. Дана строка и символ c. Выведите, есть ли c в строке, сколько раз он встречается и индекс первого вхождения.

str_5 = input("Введите строку: ")
c = input("Введите символ с для поиска: ")

if c in str_5:
    print(f"Символ {c} есть в строке")
    print(f"Встречается {str_5.count(c)} раз")
    print(f"Индекс первого вхождения: {str_5.find(c)}")
else:
    print(f"Символа {c} нет в строке")

# 6. Дана строка. Замените в ней все пробелы на подчёркивания.

str_6 = input("Введите строку: ")

print(f"Строка с заменой пробелов на подчеркивания: {str_6.replace(" ","_")}")

# 7. Дана строка с лишними пробелами в начале и в конце. Удалите их и выведите длину результата.

str_7 = "       Живите так, как вас ведет звезда            "
print(str_7)

print(str_7.strip())

# 8. Дана строка из имени и фамилии через пробел. Выведите сначала фамилию, потом имя, а затем инициалы.

str_8 = input("Введите имя и фамилию через пробел: ")

str_8=str_8.split(" ")
print(str_8)
print(f"Имя: {str_8[0]}")
print(f"Фамилия: {str_8[1]}")
print(f"Инициалы: {str_8[0].upper()}.{str_8[1].upper()}.")

# 9. Дана строка. Определите, является ли она палиндромом без учёта регистра.

str_9 = input("Введите строку для проверки на палиндром: ")

str_9 = str_9.lower().replace(" ","")

if str_9 == str_9[::-1]:
    print(f"Строка является палиндромом")
else:
    print(f"Строка не является палиндромом")

# 10. Дана строка из слов через пробел. Выведите количество слов, первое слово и последнее слово.

str_10 = "Когда вы читаете, не пытайтесь угадывать, что думает автор"
print(str_10)

str_10 = str_10.split(" ")

print(f"Количество слов в строке: {len(str_10)}")
print(f"Первое слово: {str_10[0]}")
print(f"Последнее слово: {str_10[-1]}")